joristork/robots/jobot_in_c/microchip_extras/h/p18f2682.h
extern volatile far  unsigned char       B0D2;
extern volatile far  struct {
  unsigned B0D20:1;
  unsigned B0D21:1;
  unsigned B0D22:1;
  unsigned B0D23:1;
  unsigned B0D24:1;
  unsigned B0D25:1;
  unsigned B0D26:1;
  unsigned B0D27:1;
} B0D2bits;
extern volatile far  unsigned char       B0D3;
extern volatile far  struct {
  unsigned B0D30:1;
  unsigned B0D31:1;
  unsigned B0D32:1;
  unsigned B0D33:1;
  unsigned B0D34:1;
  unsigned B0D35:1;
  unsigned B0D36:1;
  unsigned B0D37:1;
} B0D3bits;
extern volatile far  unsigned char       B0D4;
extern volatile far  struct {
  unsigned B0D40:1;
  unsigned B0D41:1;
  unsigned B0D42:1;
  unsigned B0D43:1;
  unsigned B0D44:1;
  unsigned B0D45:1;
  unsigned B0D46:1;
  unsigned B0D47:1;
} B0D4bits;
extern volatile far  unsigned char       B0D5;
extern volatile far  struct {
  unsigned B0D50:1;
  unsigned B0D51:1;
  unsigned B0D52:1;
  unsigned B0D53:1;
  unsigned B0D54:1;
  unsigned B0D55:1;
  unsigned B0D56:1;
  unsigned B0D57:1;
} B0D5bits;
extern volatile far  unsigned char       B0D6;
extern volatile far  struct {
  unsigned B0D60:1;
  unsigned B0D61:1;
  unsigned B0D62:1;
  unsigned B0D63:1;
  unsigned B0D64:1;
  unsigned B0D65:1;
  unsigned B0D66:1;
  unsigned B0D67:1;
} B0D6bits;
extern volatile far  unsigned char       B0D7;
extern volatile far  struct {
  unsigned B0D70:1;
  unsigned B0D71:1;
  unsigned B0D72:1;
  unsigned B0D73:1;
  unsigned B0D74:1;
  unsigned B0D75:1;
  unsigned B0D76:1;
  unsigned B0D77:1;
} B0D7bits;
extern volatile far  unsigned char       CANSTAT_RO9;
extern volatile far  union {
  struct {
    unsigned EICODE0:1;
    unsigned EICODE1_ICODE0:1;
    unsigned EICODE2_ICODE1:1;
    unsigned EICODE3_ICODE2:1;
    unsigned EICODE4:1;
    unsigned OPMODE0:1;
    unsigned OPMODE1:1;
    unsigned OPMODE2:1;
  };
  struct {
    unsigned ICODE0:1;
    unsigned ICODE1:1;
    unsigned ICODE2:1;
    unsigned ICODE3:1;
    unsigned ICODE4:1;
  };
} CANSTAT_RO9bits;
extern volatile far  unsigned char       CANCON_RO9;
extern volatile far  union {
  struct {
    unsigned FP0:1;
    unsigned WIN0_FP1:1;
    unsigned WIN1_FP2:1;
    unsigned WIN2_FP3:1;
    unsigned ABAT:1;
    unsigned REQOP0:1;
    unsigned REQOP1:1;
    unsigned REQOP2:1;
  };
  struct {
    unsigned :1;
    unsigned WIN0:1;
    unsigned WIN1:1;
    unsigned WIN2:1;
  };
} CANCON_RO9bits;
extern volatile far  unsigned char       B1CON;
extern volatile far  union {
  struct {
    unsigned FILHIT0_TXPRI0:1;
    unsigned FILHIT1_TXPRI1:1;
    unsigned FILHIT2_RTREN:1;
    unsigned FILHIT3_TXREQ:1;
    unsigned FILHIT4_TXERR:1;
    unsigned RXRTRRO_TXLARB:1;
    unsigned RXM1_TXABT:1;
    unsigned RXFUL_TXBIF:1;
  };
  struct {
    unsigned FILHIT0:1;
    unsigned FILHIT1:1;
    unsigned FILHIT2:1;
    unsigned FILHIT3:1;
    unsigned FILHIT4:1;
    unsigned RTRRO:1;
    unsigned RXM1:1;
    unsigned RXFUL:1;
  };
  struct {
    unsigned TXPRI0:1;
    unsigned TXPRI1:1;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABT:1;
    unsigned TXBIF:1;
  };
  struct {
    unsigned :5;
    unsigned RXRTRRO:1;
  };
} B1CONbits;
extern volatile far  unsigned char       B1SIDH;
extern volatile far  struct {
  unsigned SID3:1;
  unsigned SID4:1;
  unsigned SID5:1;
  unsigned SID6:1;
  unsigned SID7:1;
  unsigned SID8:1;
  unsigned SID9:1;
  unsigned SID10:1;
} B1SIDHbits;
extern volatile far  unsigned char       B1SIDL;
extern volatile far  union {
  struct {
    unsigned EID16:1;
    unsigned EID17:1;
    unsigned :1;
    unsigned EXIDE:1;
    unsigned SRR:1;
    unsigned SID0:1;
    unsigned SID1:1;
    unsigned SID2:1;
  };
  struct {
    unsigned :3;
    unsigned EXID:1;
  };
} B1SIDLbits;
extern volatile far  unsigned char       B1EIDH;
extern volatile far  struct {
  unsigned EID8:1;
  unsigned EID9:1;
  unsigned EID10:1;
  unsigned EID11:1;
  unsigned EID12:1;
  unsigned EID13:1;
  unsigned EID14:1;
  unsigned EID15:1;
} B1EIDHbits;
extern volatile far  unsigned char       B1EIDL;
extern volatile far  struct {
  unsigned EID0:1;
  unsigned EID1:1;
  unsigned EID2:1;
  unsigned EID3:1;
  unsigned EID4:1;
  unsigned EID5:1;
  unsigned EID6:1;
  unsigned EID7:1;
} B1EIDLbits;
extern volatile far  unsigned char       B1DLC;
extern volatile far  union {
  struct {
    unsigned DLC0:1;
    unsigned DLC1:1;
    unsigned DLC2:1;
    unsigned DLC3:1;
    unsigned RB0:1;
    unsigned RB1:1;
    unsigned RXRTR_TXRTR:1;
  };
  struct {
    unsigned :4;
    unsigned RESRB0:1;
    unsigned RESRB1:1;
    unsigned TXRTR:1;
  };
  struct {
    unsigned :6;
    unsigned RXRTR:1;
  };
} B1DLCbits;
extern volatile far  unsigned char       B1D0;
extern volatile far  struct {
  unsigned B1D00:1;
  unsigned B1D01:1;
  unsigned B1D02:1;
  unsigned B1D03:1;
  unsigned B1D04:1;
  unsigned B1D05:1;
  unsigned B1D06:1;
  unsigned B1D07:1;
} B1D0bits;
extern volatile far  unsigned char       B1D1;
extern volatile far  struct {
  unsigned B1D10:1;
  unsigned B1D11:1;
  unsigned B1D12:1;
  unsigned B1D13:1;
  unsigned B1D14:1;
  unsigned B1D15:1;
  unsigned B1D16:1;
  unsigned B1D17:1;
} B1D1bits;
extern volatile far  unsigned char       B1D2;
extern volatile far  struct {
  unsigned B1D20:1;
  unsigned B1D21:1;
  unsigned B1D22:1;
  unsigned B1D23:1;
  unsigned B1D24:1;
  unsigned B1D25:1;
  unsigned B1D26:1;
  unsigned B1D27:1;
} B1D2bits;
extern volatile far  unsigned char       B1D3;
extern volatile far  struct {
  unsigned B1D30:1;
  unsigned B1D31:1;
  unsigned B1D32:1;
  unsigned B1D33:1;
  unsigned B1D34:1;
  unsigned B1D35:1;
  unsigned B1D36:1;
  unsigned B1D37:1;
} B1D3bits;
extern volatile far  unsigned char       B1D4;
extern volatile far  struct {
  unsigned B1D40:1;
  unsigned B1D41:1;
  unsigned B1D42:1;
  unsigned B1D43:1;
  unsigned B1D44:1;
  unsigned B1D45:1;
  unsigned B1D46:1;
  unsigned B1D47:1;
} B1D4bits;
extern volatile far  unsigned char       B1D5;
extern volatile far  struct {
  unsigned B1D50:1;
  unsigned B1D51:1;
  unsigned B1D52:1;
  unsigned B1D53:1;
  unsigned B1D54:1;
  unsigned B1D55:1;
  unsigned B1D56:1;
  unsigned B1D57:1;
} B1D5bits;
extern volatile far  unsigned char       B1D6;
extern volatile far  struct {
  unsigned B1D60:1;
  unsigned B1D61:1;
  unsigned B1D62:1;
  unsigned B1D63:1;
  unsigned B1D64:1;
  unsigned B1D65:1;
  unsigned B1D66:1;
  unsigned B1D67:1;
} B1D6bits;
